{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "!pip install ipython-cypher -q"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## The Graph of Thrones"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"images/got-community.jpeg\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Character Interaction Networks for George R. R. Martin's \"A Song of Ice and Fire\" saga**\n",
    "\n",
    "These networks were created by connecting two characters whenever their names (or nicknames) appeared within **15 words** of one another in one of the books in \"A Song of Ice and Fire.\"  \n",
    "The edge weight corresponds to the number of interactions.\n",
    "\n",
    "This is the data for the work presented here: https://networkofthrones.wordpress.com by Andrew Beveridge."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### **Data**\n",
    "\n",
    "All of the network data is available on GitHub. Have fun!\n",
    "\n",
    "[Network Data for the Books - https://github.com/mathbeveridge/asoiaf](https://github.com/mathbeveridge/asoiaf)\n",
    "    \n",
    "[Network Data for the Series - https://github.com/mathbeveridge/gameofthrones](https://github.com/mathbeveridge/gameofthrones)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Clean the database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "187 nodes deleted.\n",
      "684 relationship deleted.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "Match(n)-[r]-(m) delete r,n            "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### **Load Data**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "CREATE CONSTRAINT ON (c:Character) ASSERT c.name IS UNIQUE"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### **Livro I**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>row</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;Target&#x27;: &#x27;Jaime-Lannister&#x27;, &#x27;Type&#x27;: &#x27;Undirected&#x27;, &#x27;book&#x27;: &#x27;1&#x27;, &#x27;weight&#x27;: &#x27;3&#x27;, &#x27;Source&#x27;: &#x27;Addam-Marbrand&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;Target&#x27;: &#x27;Tywin-Lannister&#x27;, &#x27;Type&#x27;: &#x27;Undirected&#x27;, &#x27;book&#x27;: &#x27;1&#x27;, &#x27;weight&#x27;: &#x27;6&#x27;, &#x27;Source&#x27;: &#x27;Addam-Marbrand&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;Target&#x27;: &#x27;Daenerys-Targaryen&#x27;, &#x27;Type&#x27;: &#x27;Undirected&#x27;, &#x27;book&#x27;: &#x27;1&#x27;, &#x27;weight&#x27;: &#x27;5&#x27;, &#x27;Source&#x27;: &#x27;Aegon-I-Targaryen&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;Target&#x27;: &#x27;Eddard-Stark&#x27;, &#x27;Type&#x27;: &#x27;Undirected&#x27;, &#x27;book&#x27;: &#x27;1&#x27;, &#x27;weight&#x27;: &#x27;4&#x27;, &#x27;Source&#x27;: &#x27;Aegon-I-Targaryen&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;Target&#x27;: &#x27;Alliser-Thorne&#x27;, &#x27;Type&#x27;: &#x27;Undirected&#x27;, &#x27;book&#x27;: &#x27;1&#x27;, &#x27;weight&#x27;: &#x27;4&#x27;, &#x27;Source&#x27;: &#x27;Aemon-Targaryen-(Maester-Aemon)&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;Target&#x27;: &#x27;Bowen-Marsh&#x27;, &#x27;Type&#x27;: &#x27;Undirected&#x27;, &#x27;book&#x27;: &#x27;1&#x27;, &#x27;weight&#x27;: &#x27;4&#x27;, &#x27;Source&#x27;: &#x27;Aemon-Targaryen-(Maester-Aemon)&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;Target&#x27;: &#x27;Chett&#x27;, &#x27;Type&#x27;: &#x27;Undirected&#x27;, &#x27;book&#x27;: &#x27;1&#x27;, &#x27;weight&#x27;: &#x27;9&#x27;, &#x27;Source&#x27;: &#x27;Aemon-Targaryen-(Maester-Aemon)&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;Target&#x27;: &#x27;Clydas&#x27;, &#x27;Type&#x27;: &#x27;Undirected&#x27;, &#x27;book&#x27;: &#x27;1&#x27;, &#x27;weight&#x27;: &#x27;5&#x27;, &#x27;Source&#x27;: &#x27;Aemon-Targaryen-(Maester-Aemon)&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;Target&#x27;: &#x27;Jeor-Mormont&#x27;, &#x27;Type&#x27;: &#x27;Undirected&#x27;, &#x27;book&#x27;: &#x27;1&#x27;, &#x27;weight&#x27;: &#x27;13&#x27;, &#x27;Source&#x27;: &#x27;Aemon-Targaryen-(Maester-Aemon)&#x27;}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;Target&#x27;: &#x27;Jon-Snow&#x27;, &#x27;Type&#x27;: &#x27;Undirected&#x27;, &#x27;book&#x27;: &#x27;1&#x27;, &#x27;weight&#x27;: &#x27;34&#x27;, &#x27;Source&#x27;: &#x27;Aemon-Targaryen-(Maester-Aemon)&#x27;}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'Target': 'Jaime-Lannister',\n",
       "   'Type': 'Undirected',\n",
       "   'book': '1',\n",
       "   'weight': '3',\n",
       "   'Source': 'Addam-Marbrand'}],\n",
       " [{'Target': 'Tywin-Lannister',\n",
       "   'Type': 'Undirected',\n",
       "   'book': '1',\n",
       "   'weight': '6',\n",
       "   'Source': 'Addam-Marbrand'}],\n",
       " [{'Target': 'Daenerys-Targaryen',\n",
       "   'Type': 'Undirected',\n",
       "   'book': '1',\n",
       "   'weight': '5',\n",
       "   'Source': 'Aegon-I-Targaryen'}],\n",
       " [{'Target': 'Eddard-Stark',\n",
       "   'Type': 'Undirected',\n",
       "   'book': '1',\n",
       "   'weight': '4',\n",
       "   'Source': 'Aegon-I-Targaryen'}],\n",
       " [{'Target': 'Alliser-Thorne',\n",
       "   'Type': 'Undirected',\n",
       "   'book': '1',\n",
       "   'weight': '4',\n",
       "   'Source': 'Aemon-Targaryen-(Maester-Aemon)'}],\n",
       " [{'Target': 'Bowen-Marsh',\n",
       "   'Type': 'Undirected',\n",
       "   'book': '1',\n",
       "   'weight': '4',\n",
       "   'Source': 'Aemon-Targaryen-(Maester-Aemon)'}],\n",
       " [{'Target': 'Chett',\n",
       "   'Type': 'Undirected',\n",
       "   'book': '1',\n",
       "   'weight': '9',\n",
       "   'Source': 'Aemon-Targaryen-(Maester-Aemon)'}],\n",
       " [{'Target': 'Clydas',\n",
       "   'Type': 'Undirected',\n",
       "   'book': '1',\n",
       "   'weight': '5',\n",
       "   'Source': 'Aemon-Targaryen-(Maester-Aemon)'}],\n",
       " [{'Target': 'Jeor-Mormont',\n",
       "   'Type': 'Undirected',\n",
       "   'book': '1',\n",
       "   'weight': '13',\n",
       "   'Source': 'Aemon-Targaryen-(Maester-Aemon)'}],\n",
       " [{'Target': 'Jon-Snow',\n",
       "   'Type': 'Undirected',\n",
       "   'book': '1',\n",
       "   'weight': '34',\n",
       "   'Source': 'Aemon-Targaryen-(Maester-Aemon)'}]]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book1-edges.csv\" AS row\n",
    "with row limit 10 return row"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "187 nodes created.\n",
      "1555 properties set.\n",
      "684 relationships created.\n",
      "187 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book1-edges.csv\" AS row\n",
    "MERGE (src:Character {name: row.Source})\n",
    "MERGE (tgt:Character {name: row.Target})\n",
    "MERGE (src)-[r:INTERACTS1]->(tgt)\n",
    "ON CREATE SET r.weight = toInt(row.weight), r.book=1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### **Livro II**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "169 nodes created.\n",
      "1719 properties set.\n",
      "775 relationships created.\n",
      "169 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book2-edges.csv\" AS row\n",
    "MERGE (src:Character {name: row.Source})\n",
    "MERGE (tgt:Character {name: row.Target})\n",
    "MERGE (src)-[r:INTERACTS2]->(tgt)\n",
    "ON CREATE SET r.weight = toInt(row.weight), r.book=2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### **Livro III**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "142 nodes created.\n",
      "2158 properties set.\n",
      "1008 relationships created.\n",
      "142 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book3-edges.csv\" AS row\n",
    "MERGE (src:Character {name: row.Source})\n",
    "MERGE (tgt:Character {name: row.Target})\n",
    "MERGE (src)-[r:INTERACTS3]->(tgt)\n",
    "ON CREATE SET r.weight = toInt(row.weight), r.book=3"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### **Livros IV e V**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "298 nodes created.\n",
      "2956 properties set.\n",
      "1329 relationships created.\n",
      "298 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book45-edges.csv\" AS row\n",
    "MERGE (src:Character {name: row.Source})\n",
    "MERGE (tgt:Character {name: row.Target})\n",
    "MERGE (src)-[r:INTERACTS45]->(tgt)\n",
    "ON CREATE SET r.weight = toInt(row.weight), r.book=45"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### **DB SCHEMA**"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"images/graph-schema.png\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Quantos personagens temos?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>nr_personagens</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>796</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[796]]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH (c:Character)\n",
    "RETURN count(c) as nr_personagens"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Quantas interações existem em cada livro?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>book</th>\n",
       "        <th>interacoes</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>1</td>\n",
       "        <td>684</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>2</td>\n",
       "        <td>775</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>3</td>\n",
       "        <td>1008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>45</td>\n",
       "        <td>1329</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[1, 684], [2, 775], [3, 1008], [45, 1329]]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH ()-[r]->()\n",
    "RETURN r.book as book, count(r) as interacoes\n",
    "ORDER BY book"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Número de interações da Arya-Stark ao longo dos livros"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>book</th>\n",
       "        <th>interacoes</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>1</td>\n",
       "        <td>27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>2</td>\n",
       "        <td>37</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>3</td>\n",
       "        <td>36</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>45</td>\n",
       "        <td>24</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[1, 27], [2, 37], [3, 36], [45, 24]]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH (c:Character {name:'Arya-Stark'})-[r]->()\n",
    "RETURN r.book as book, count(r) as interacoes\n",
    "ORDER BY book"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Pesonagems que Arya-Stark mais se interage"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>interacoes</th>\n",
       "        <th>personagem</th>\n",
       "        <th>r.book</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>104</td>\n",
       "        <td>Sansa-Stark</td>\n",
       "        <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>51</td>\n",
       "        <td>Hot-Pie</td>\n",
       "        <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>48</td>\n",
       "        <td>Sandor-Clegane</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>46</td>\n",
       "        <td>Gendry</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>39</td>\n",
       "        <td>Mordane</td>\n",
       "        <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>39</td>\n",
       "        <td>Joffrey-Baratheon</td>\n",
       "        <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>37</td>\n",
       "        <td>Jon-Snow</td>\n",
       "        <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>36</td>\n",
       "        <td>Gendry</td>\n",
       "        <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>31</td>\n",
       "        <td>Lommy-Greenhands</td>\n",
       "        <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>30</td>\n",
       "        <td>Eddard-Stark</td>\n",
       "        <td>1</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[104, 'Sansa-Stark', 1],\n",
       " [51, 'Hot-Pie', 2],\n",
       " [48, 'Sandor-Clegane', 3],\n",
       " [46, 'Gendry', 3],\n",
       " [39, 'Mordane', 1],\n",
       " [39, 'Joffrey-Baratheon', 1],\n",
       " [37, 'Jon-Snow', 1],\n",
       " [36, 'Gendry', 2],\n",
       " [31, 'Lommy-Greenhands', 2],\n",
       " [30, 'Eddard-Stark', 1]]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH (c:Character {name:'Arya-Stark'})-[r]->(c2:Character)\n",
    "RETURN sum(r.weight) as interacoes, c2.name as personagem, r.book\n",
    "ORDER BY interacoes desc limit 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Interação entre Arya-Stark e Sansa-Stark ao longo dos livros"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c.name</th>\n",
       "        <th>interacoes</th>\n",
       "        <th>c2.name</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Arya-Stark</td>\n",
       "        <td>104</td>\n",
       "        <td>Sansa-Stark</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Arya-Stark</td>\n",
       "        <td>20</td>\n",
       "        <td>Sansa-Stark</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Arya-Stark</td>\n",
       "        <td>23</td>\n",
       "        <td>Sansa-Stark</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Arya-Stark</td>\n",
       "        <td>8</td>\n",
       "        <td>Sansa-Stark</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Arya-Stark', 104, 'Sansa-Stark'],\n",
       " ['Arya-Stark', 20, 'Sansa-Stark'],\n",
       " ['Arya-Stark', 23, 'Sansa-Stark'],\n",
       " ['Arya-Stark', 8, 'Sansa-Stark']]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH (c:Character {name:'Arya-Stark'})-[r]->(c2:Character {name:'Sansa-Stark'}) \n",
    "return c.name , r.weight as interacoes, c2.name"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "--- "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Diâmetro da rede"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> The diameter (or geodesic) of a network is defined as the longest shortest path in the network."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"images/network-diameter.gif\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Caminho curto mais longo na rede no segundo livro."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>path</th>\n",
       "        <th>len</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;Steffon-Varner&#x27;}, {&#x27;name&#x27;: &#x27;Eldon-Estermont&#x27;}, {&#x27;name&#x27;: &#x27;Bryce-Caron&#x27;}, {&#x27;name&#x27;: &#x27;Renly-Baratheon&#x27;}, {&#x27;name&#x27;: &#x27;Tywin-Lannister&#x27;}, {&#x27;name&#x27;: &#x27;Amory-Lorch&#x27;}, {&#x27;name&#x27;: &#x27;Gendry&#x27;}, {&#x27;name&#x27;: &#x27;Cutjack&#x27;}, {&#x27;name&#x27;: &#x27;Tarber&#x27;}]</td>\n",
       "        <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;Murch&#x27;}, {&#x27;name&#x27;: &#x27;Gariss&#x27;}, {&#x27;name&#x27;: &#x27;Aggar&#x27;}, {&#x27;name&#x27;: &#x27;Ramsay-Snow&#x27;}, {&#x27;name&#x27;: &#x27;Roose-Bolton&#x27;}, {&#x27;name&#x27;: &#x27;Amory-Lorch&#x27;}, {&#x27;name&#x27;: &#x27;Gendry&#x27;}, {&#x27;name&#x27;: &#x27;Cutjack&#x27;}, {&#x27;name&#x27;: &#x27;Kurz&#x27;}]</td>\n",
       "        <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;Steffon-Varner&#x27;}, {&#x27;name&#x27;: &#x27;Eldon-Estermont&#x27;}, {&#x27;name&#x27;: &#x27;Bryce-Caron&#x27;}, {&#x27;name&#x27;: &#x27;Renly-Baratheon&#x27;}, {&#x27;name&#x27;: &#x27;Tywin-Lannister&#x27;}, {&#x27;name&#x27;: &#x27;Amory-Lorch&#x27;}, {&#x27;name&#x27;: &#x27;Gendry&#x27;}, {&#x27;name&#x27;: &#x27;Cutjack&#x27;}, {&#x27;name&#x27;: &#x27;Kurz&#x27;}]</td>\n",
       "        <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;Murch&#x27;}, {&#x27;name&#x27;: &#x27;Gariss&#x27;}, {&#x27;name&#x27;: &#x27;Aggar&#x27;}, {&#x27;name&#x27;: &#x27;Ramsay-Snow&#x27;}, {&#x27;name&#x27;: &#x27;Robb-Stark&#x27;}, {&#x27;name&#x27;: &#x27;Renly-Baratheon&#x27;}, {&#x27;name&#x27;: &#x27;Bryce-Caron&#x27;}, {&#x27;name&#x27;: &#x27;Eldon-Estermont&#x27;}, {&#x27;name&#x27;: &#x27;Steffon-Varner&#x27;}]</td>\n",
       "        <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;Murch&#x27;}, {&#x27;name&#x27;: &#x27;Gariss&#x27;}, {&#x27;name&#x27;: &#x27;Aggar&#x27;}, {&#x27;name&#x27;: &#x27;Ramsay-Snow&#x27;}, {&#x27;name&#x27;: &#x27;Roose-Bolton&#x27;}, {&#x27;name&#x27;: &#x27;Amory-Lorch&#x27;}, {&#x27;name&#x27;: &#x27;Gendry&#x27;}, {&#x27;name&#x27;: &#x27;Cutjack&#x27;}, {&#x27;name&#x27;: &#x27;Tarber&#x27;}]</td>\n",
       "        <td>8</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[[{'name': 'Steffon-Varner'},\n",
       "   {'name': 'Eldon-Estermont'},\n",
       "   {'name': 'Bryce-Caron'},\n",
       "   {'name': 'Renly-Baratheon'},\n",
       "   {'name': 'Tywin-Lannister'},\n",
       "   {'name': 'Amory-Lorch'},\n",
       "   {'name': 'Gendry'},\n",
       "   {'name': 'Cutjack'},\n",
       "   {'name': 'Tarber'}],\n",
       "  8],\n",
       " [[{'name': 'Murch'},\n",
       "   {'name': 'Gariss'},\n",
       "   {'name': 'Aggar'},\n",
       "   {'name': 'Ramsay-Snow'},\n",
       "   {'name': 'Roose-Bolton'},\n",
       "   {'name': 'Amory-Lorch'},\n",
       "   {'name': 'Gendry'},\n",
       "   {'name': 'Cutjack'},\n",
       "   {'name': 'Kurz'}],\n",
       "  8],\n",
       " [[{'name': 'Steffon-Varner'},\n",
       "   {'name': 'Eldon-Estermont'},\n",
       "   {'name': 'Bryce-Caron'},\n",
       "   {'name': 'Renly-Baratheon'},\n",
       "   {'name': 'Tywin-Lannister'},\n",
       "   {'name': 'Amory-Lorch'},\n",
       "   {'name': 'Gendry'},\n",
       "   {'name': 'Cutjack'},\n",
       "   {'name': 'Kurz'}],\n",
       "  8],\n",
       " [[{'name': 'Murch'},\n",
       "   {'name': 'Gariss'},\n",
       "   {'name': 'Aggar'},\n",
       "   {'name': 'Ramsay-Snow'},\n",
       "   {'name': 'Robb-Stark'},\n",
       "   {'name': 'Renly-Baratheon'},\n",
       "   {'name': 'Bryce-Caron'},\n",
       "   {'name': 'Eldon-Estermont'},\n",
       "   {'name': 'Steffon-Varner'}],\n",
       "  8],\n",
       " [[{'name': 'Murch'},\n",
       "   {'name': 'Gariss'},\n",
       "   {'name': 'Aggar'},\n",
       "   {'name': 'Ramsay-Snow'},\n",
       "   {'name': 'Roose-Bolton'},\n",
       "   {'name': 'Amory-Lorch'},\n",
       "   {'name': 'Gendry'},\n",
       "   {'name': 'Cutjack'},\n",
       "   {'name': 'Tarber'}],\n",
       "  8]]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH (a:Character), (b:Character) WHERE id(a) > id(b)\n",
    "MATCH p = shortestPath((a)-[:INTERACTS2*]-(b))\n",
    "WITH length(p) AS len, p\n",
    "ORDER BY len DESC\n",
    "LIMIT 5\n",
    "RETURN nodes(p) AS path, len"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "--- "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Medidas de Centralidade"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"images/measures.png\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "--- "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Degree Centrality"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> The Degree Centrality algorithm **measures the number of incoming and outgoing relationships** from a node, and helps us find the **most popular nodes** in a graph."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The following query finds the most popular characters in the 1st book, based on the number of character interactions:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>personagem</th>\n",
       "        <th>score</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tyrion-Lannister</td>\n",
       "        <td>829.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Joffrey-Baratheon</td>\n",
       "        <td>629.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cersei-Lannister</td>\n",
       "        <td>515.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bran-Stark</td>\n",
       "        <td>486.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Stannis-Baratheon</td>\n",
       "        <td>461.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Arya-Stark</td>\n",
       "        <td>424.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jon-Snow</td>\n",
       "        <td>360.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Renly-Baratheon</td>\n",
       "        <td>357.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robb-Stark</td>\n",
       "        <td>344.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Catelyn-Stark</td>\n",
       "        <td>320.0</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Tyrion-Lannister', 829.0],\n",
       " ['Joffrey-Baratheon', 629.0],\n",
       " ['Cersei-Lannister', 515.0],\n",
       " ['Bran-Stark', 486.0],\n",
       " ['Stannis-Baratheon', 461.0],\n",
       " ['Arya-Stark', 424.0],\n",
       " ['Jon-Snow', 360.0],\n",
       " ['Renly-Baratheon', 357.0],\n",
       " ['Robb-Stark', 344.0],\n",
       " ['Catelyn-Stark', 320.0]]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "CALL algo.degree.stream(\"Character\", \"INTERACTS2\", {\n",
    "  direction: \"BOTH\",\n",
    "  weightProperty: \"weight\"\n",
    "})\n",
    "YIELD nodeId, score\n",
    "RETURN algo.asNode(nodeId).name AS personagem, score\n",
    "ORDER BY score DESC\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Betweenness Centrality "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"images/betweenness-centrality.png\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> Betweenness centrality **identifies nodes that are strategically positioned in the network**, meaning that information will often travel through that person.  \n",
    "Such an intermediary position gives that person **power and influence**.\n",
    "\n",
    "Betweenness centrality is a raw count of the number of short paths that go through a given node. For example, if a node is located on a bottleneck between two large communities, then it will have high betweenness."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>personagem</th>\n",
       "        <th>centrality</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Eddard-Stark</td>\n",
       "        <td>4638.534951255039</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robert-Baratheon</td>\n",
       "        <td>3682.3910357678133</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tyrion-Lannister</td>\n",
       "        <td>3272.6060155260348</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jon-Snow</td>\n",
       "        <td>2952.057281565677</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Catelyn-Stark</td>\n",
       "        <td>2604.755646755593</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Daenerys-Targaryen</td>\n",
       "        <td>1484.2780232288708</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robb-Stark</td>\n",
       "        <td>1255.6896562838224</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drogo</td>\n",
       "        <td>1115.0946392450378</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bran-Stark</td>\n",
       "        <td>960.0319135675135</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sansa-Stark</td>\n",
       "        <td>639.0769144474225</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Eddard-Stark', 4638.534951255039],\n",
       " ['Robert-Baratheon', 3682.3910357678133],\n",
       " ['Tyrion-Lannister', 3272.6060155260348],\n",
       " ['Jon-Snow', 2952.057281565677],\n",
       " ['Catelyn-Stark', 2604.755646755593],\n",
       " ['Daenerys-Targaryen', 1484.2780232288708],\n",
       " ['Robb-Stark', 1255.6896562838224],\n",
       " ['Drogo', 1115.0946392450378],\n",
       " ['Bran-Stark', 960.0319135675135],\n",
       " ['Sansa-Stark', 639.0769144474225]]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "CALL algo.betweenness.stream(\"Character\", \"INTERACTS1\", {\n",
    "  direction: \"BOTH\"\n",
    "})\n",
    "YIELD nodeId, centrality\n",
    "RETURN algo.asNode(nodeId).name as personagem, centrality\n",
    "ORDER BY centrality DESC\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>loadMillis</th>\n",
       "        <th>computeMillis</th>\n",
       "        <th>writeMillis</th>\n",
       "        <th>nodes</th>\n",
       "        <th>minCentrality</th>\n",
       "        <th>maxCentrality</th>\n",
       "        <th>sumCentrality</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>5</td>\n",
       "        <td>8</td>\n",
       "        <td>3</td>\n",
       "        <td>796</td>\n",
       "        <td>-1.0</td>\n",
       "        <td>-1.0</td>\n",
       "        <td>-1.0</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[5, 8, 3, 796, -1.0, -1.0, -1.0]]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "CALL algo.betweenness(\"Character\", \"INTERACTS1\", {direction: \"BOTH\", writeProperty: \"book1BetweennessCentrality\"})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "--- "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Closeness Centrality"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Closeness centrality is a **way of detecting nodes that are able to spread information very efficiently through a graph.**  \n",
    "The closeness centrality of a node **measures its average farness (inverse distance) to all other nodes**. \n",
    "\n",
    "**Nodes with a high closeness score have the shortest distances to all other nodes.**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>personagem</th>\n",
       "        <th>centrality</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robb-Stark</td>\n",
       "        <td>0.4777777777777778</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Eddard-Stark</td>\n",
       "        <td>0.4574468085106383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robert-Baratheon</td>\n",
       "        <td>0.44869565217391305</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jaime-Lannister</td>\n",
       "        <td>0.44714038128249567</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tyrion-Lannister</td>\n",
       "        <td>0.4440619621342513</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Joffrey-Baratheon</td>\n",
       "        <td>0.4387755102040816</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Arya-Stark</td>\n",
       "        <td>0.4350758853288364</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Catelyn-Stark</td>\n",
       "        <td>0.4336134453781513</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cersei-Lannister</td>\n",
       "        <td>0.4307178631051753</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sansa-Stark</td>\n",
       "        <td>0.4307178631051753</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Robb-Stark', 0.4777777777777778],\n",
       " ['Eddard-Stark', 0.4574468085106383],\n",
       " ['Robert-Baratheon', 0.44869565217391305],\n",
       " ['Jaime-Lannister', 0.44714038128249567],\n",
       " ['Tyrion-Lannister', 0.4440619621342513],\n",
       " ['Joffrey-Baratheon', 0.4387755102040816],\n",
       " ['Arya-Stark', 0.4350758853288364],\n",
       " ['Catelyn-Stark', 0.4336134453781513],\n",
       " ['Cersei-Lannister', 0.4307178631051753],\n",
       " ['Sansa-Stark', 0.4307178631051753]]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "CALL algo.closeness.stream(\"Character\", \"INTERACTS2\", {\n",
    "  direction: \"BOTH\"\n",
    "})\n",
    "YIELD nodeId, centrality\n",
    "RETURN algo.asNode(nodeId).name  as personagem, centrality\n",
    "ORDER BY centrality DESC\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "--- "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### PageRank"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"images/pagerank.svg.png\" width=\"360px\" height=\"360px\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> PageRank captures how effectively you are taking advantage of your network contacts. \n",
    "\n",
    "In our context, PageRank centrality nicely captures narrative tension.   \n",
    "Indeed, major developments occur when two important characters interact."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>personagem</th>\n",
       "        <th>score</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tyrion-Lannister</td>\n",
       "        <td>5.63370146796147</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tywin-Lannister</td>\n",
       "        <td>4.113908375703381</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Varys</td>\n",
       "        <td>3.8021566752707283</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Stannis-Baratheon</td>\n",
       "        <td>3.042802365479643</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sansa-Stark</td>\n",
       "        <td>2.87449812875204</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Walder-Frey</td>\n",
       "        <td>2.5437637083167632</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Samwell-Tarly</td>\n",
       "        <td>2.1651436854794675</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robb-Stark</td>\n",
       "        <td>1.9518855025131452</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tommen-Baratheon</td>\n",
       "        <td>1.7722262736362548</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Viserys-Targaryen</td>\n",
       "        <td>1.7228457572694054</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Tyrion-Lannister', 5.63370146796147],\n",
       " ['Tywin-Lannister', 4.113908375703381],\n",
       " ['Varys', 3.8021566752707283],\n",
       " ['Stannis-Baratheon', 3.042802365479643],\n",
       " ['Sansa-Stark', 2.87449812875204],\n",
       " ['Walder-Frey', 2.5437637083167632],\n",
       " ['Samwell-Tarly', 2.1651436854794675],\n",
       " ['Robb-Stark', 1.9518855025131452],\n",
       " ['Tommen-Baratheon', 1.7722262736362548],\n",
       " ['Viserys-Targaryen', 1.7228457572694054]]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "CALL algo.pageRank.stream(\"Character\", \"INTERACTS3\", {iterations:20, dampingFactor:0.85})\n",
    "YIELD nodeId, score\n",
    "RETURN algo.asNode(nodeId).name  as personagem, score\n",
    "ORDER BY score DESC\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>nodes</th>\n",
       "        <th>iterations</th>\n",
       "        <th>loadMillis</th>\n",
       "        <th>computeMillis</th>\n",
       "        <th>writeMillis</th>\n",
       "        <th>dampingFactor</th>\n",
       "        <th>write</th>\n",
       "        <th>writeProperty</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>796</td>\n",
       "        <td>20</td>\n",
       "        <td>4</td>\n",
       "        <td>6</td>\n",
       "        <td>2</td>\n",
       "        <td>0.85</td>\n",
       "        <td>True</td>\n",
       "        <td>book1PageRank</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[796, 20, 4, 6, 2, 0.85, True, 'book1PageRank']]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "CALL algo.pageRank(\"Character\", \"INTERACTS1\", {direction: \"BOTH\", writeProperty:'book1PageRank'})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Community Detection"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"images/community.png\" width=\"360px\" height=\"360px\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>loadMillis</th>\n",
       "        <th>computeMillis</th>\n",
       "        <th>writeMillis</th>\n",
       "        <th>postProcessingMillis</th>\n",
       "        <th>nodes</th>\n",
       "        <th>communityCount</th>\n",
       "        <th>iterations</th>\n",
       "        <th>didConverge</th>\n",
       "        <th>p1</th>\n",
       "        <th>p5</th>\n",
       "        <th>p10</th>\n",
       "        <th>p25</th>\n",
       "        <th>p50</th>\n",
       "        <th>p75</th>\n",
       "        <th>p90</th>\n",
       "        <th>p95</th>\n",
       "        <th>p99</th>\n",
       "        <th>p100</th>\n",
       "        <th>weightProperty</th>\n",
       "        <th>write</th>\n",
       "        <th>partitionProperty</th>\n",
       "        <th>writeProperty</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>57</td>\n",
       "        <td>2</td>\n",
       "        <td>0</td>\n",
       "        <td>2</td>\n",
       "        <td>796</td>\n",
       "        <td>127</td>\n",
       "        <td>1</td>\n",
       "        <td>False</td>\n",
       "        <td>1</td>\n",
       "        <td>1</td>\n",
       "        <td>1</td>\n",
       "        <td>1</td>\n",
       "        <td>2</td>\n",
       "        <td>3</td>\n",
       "        <td>8</td>\n",
       "        <td>38</td>\n",
       "        <td>91</td>\n",
       "        <td>117</td>\n",
       "        <td>weight</td>\n",
       "        <td>True</td>\n",
       "        <td>community</td>\n",
       "        <td>community</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[57,\n",
       "  2,\n",
       "  0,\n",
       "  2,\n",
       "  796,\n",
       "  127,\n",
       "  1,\n",
       "  False,\n",
       "  1,\n",
       "  1,\n",
       "  1,\n",
       "  1,\n",
       "  2,\n",
       "  3,\n",
       "  8,\n",
       "  38,\n",
       "  91,\n",
       "  117,\n",
       "  'weight',\n",
       "  True,\n",
       "  'community',\n",
       "  'community']]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "CALL algo.labelPropagation(\n",
    "  'MATCH (c:Character) RETURN id(c) as id',\n",
    "  'MATCH (c:Character)-[rel]-(c2) RETURN id(c) as source, id(c2) as target, SUM(rel.weight) as weight',\n",
    "  {graph:'cypher', partitionProperty: 'community'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>count(distinct c.community)</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>127</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[127]]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH (c:Character)\n",
    "WHERE exists(c.community) return count(distinct c.community)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Querying Communities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>community</th>\n",
       "        <th>count</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>224</td>\n",
       "        <td>117</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>279</td>\n",
       "        <td>91</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>232</td>\n",
       "        <td>59</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>333</td>\n",
       "        <td>52</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>222</td>\n",
       "        <td>48</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>209</td>\n",
       "        <td>43</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>331</td>\n",
       "        <td>38</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>269</td>\n",
       "        <td>31</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>242</td>\n",
       "        <td>28</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>260</td>\n",
       "        <td>23</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[224, 117],\n",
       " [279, 91],\n",
       " [232, 59],\n",
       " [333, 52],\n",
       " [222, 48],\n",
       " [209, 43],\n",
       " [331, 38],\n",
       " [269, 31],\n",
       " [242, 28],\n",
       " [260, 23]]"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH (c:Character)\n",
    "WHERE exists(c.community)\n",
    "RETURN c.community as community, count(c) AS count\n",
    "ORDER BY count DESC limit 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> It’d be good to know who are the **influential people in each community**. To do that we’ll need to calculate a **PageRank score for each character across all the books**:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>nodes</th>\n",
       "        <th>iterations</th>\n",
       "        <th>loadMillis</th>\n",
       "        <th>computeMillis</th>\n",
       "        <th>writeMillis</th>\n",
       "        <th>dampingFactor</th>\n",
       "        <th>write</th>\n",
       "        <th>writeProperty</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>796</td>\n",
       "        <td>20</td>\n",
       "        <td>36</td>\n",
       "        <td>8</td>\n",
       "        <td>1</td>\n",
       "        <td>0.85</td>\n",
       "        <td>True</td>\n",
       "        <td>pageRank</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[796, 20, 36, 8, 1, 0.85, True, 'pageRank']]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "CALL algo.pageRank('MATCH (c:Character) RETURN id(c) as id', 'MATCH (c:Character)-[rel]-(c2) RETURN id(c) as source, id(c2) as target, SUM(rel.weight) as weight', {graph:'cypher', writeProperty: 'pageRank'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>cluster</th>\n",
       "        <th>count</th>\n",
       "        <th>influencers</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>224</td>\n",
       "        <td>117</td>\n",
       "        <td>[&#x27;Tyrion-Lannister&#x27;, &#x27;Jaime-Lannister&#x27;, &#x27;Cersei-Lannister&#x27;, &#x27;Sansa-Stark&#x27;, &#x27;Joffrey-Baratheon&#x27;, &#x27;Tywin-Lannister&#x27;, &#x27;Petyr-Baelish&#x27;, &#x27;Varys&#x27;, &#x27;Tommen-Baratheon&#x27;, &#x27;Gregor-Clegane&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>279</td>\n",
       "        <td>91</td>\n",
       "        <td>[&#x27;Jon-Snow&#x27;, &#x27;Samwell-Tarly&#x27;, &#x27;Mance-Rayder&#x27;, &#x27;Jeor-Mormont&#x27;, &#x27;Aemon-Targaryen-(Maester-Aemon)&#x27;, &#x27;Janos-Slynt&#x27;, &#x27;Eddison-Tollett&#x27;, &#x27;Tormund&#x27;, &#x27;Bowen-Marsh&#x27;, &#x27;Craster&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>232</td>\n",
       "        <td>59</td>\n",
       "        <td>[&#x27;Daenerys-Targaryen&#x27;, &#x27;Barristan-Selmy&#x27;, &#x27;Jorah-Mormont&#x27;, &#x27;Hizdahr-zo-Loraq&#x27;, &#x27;Quentyn-Martell&#x27;, &#x27;Drogo&#x27;, &#x27;Daario-Naharis&#x27;, &#x27;Rhaegar-Targaryen&#x27;, &#x27;Irri&#x27;, &#x27;Viserys-Targaryen&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>333</td>\n",
       "        <td>52</td>\n",
       "        <td>[&#x27;Theon-Greyjoy&#x27;, &#x27;Asha-Greyjoy&#x27;, &#x27;Ramsay-Snow&#x27;, &#x27;Roose-Bolton&#x27;, &#x27;Aeron-Greyjoy&#x27;, &#x27;Balon-Greyjoy&#x27;, &#x27;Lorren&#x27;, &#x27;Jeyne-Poole&#x27;, &#x27;Hagen&#x27;, &#x27;Aggar&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>222</td>\n",
       "        <td>48</td>\n",
       "        <td>[&#x27;Catelyn-Stark&#x27;, &#x27;Robb-Stark&#x27;, &#x27;Edmure-Tully&#x27;, &#x27;Lysa-Arryn&#x27;, &#x27;Robert-Arryn&#x27;, &#x27;Brynden-Tully&#x27;, &#x27;Jon-Umber-(Greatjon)&#x27;, &#x27;Ryman-Frey&#x27;, &#x27;Rickard-Karstark&#x27;, &#x27;Lothar-Frey&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>209</td>\n",
       "        <td>43</td>\n",
       "        <td>[&#x27;Arya-Stark&#x27;, &#x27;Gendry&#x27;, &#x27;Yoren&#x27;, &#x27;Amory-Lorch&#x27;, &#x27;Beric-Dondarrion&#x27;, &#x27;Lem&#x27;, &#x27;Hot-Pie&#x27;, &#x27;Harwin&#x27;, &#x27;Anguy&#x27;, &#x27;Tom-of-Sevenstreams&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>331</td>\n",
       "        <td>38</td>\n",
       "        <td>[&#x27;Stannis-Baratheon&#x27;, &#x27;Davos-Seaworth&#x27;, &#x27;Renly-Baratheon&#x27;, &#x27;Melisandre&#x27;, &#x27;Selyse-Florent&#x27;, &#x27;Randyll-Tarly&#x27;, &#x27;Axell-Florent&#x27;, &#x27;Cressen&#x27;, &#x27;Mathis-Rowan&#x27;, &#x27;Godry-Farring&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>269</td>\n",
       "        <td>31</td>\n",
       "        <td>[&#x27;Brienne-of-Tarth&#x27;, &#x27;Loras-Tyrell&#x27;, &#x27;Aerys-II-Targaryen&#x27;, &#x27;Addam-Marbrand&#x27;, &#x27;Vargo-Hoat&#x27;, &#x27;Cleos-Frey&#x27;, &#x27;Dick-Crabb&#x27;, &#x27;Walton&#x27;, &#x27;Lyle-Crakehall&#x27;, &#x27;Pia&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>242</td>\n",
       "        <td>28</td>\n",
       "        <td>[&#x27;Eddard-Stark&#x27;, &#x27;Robert-Baratheon&#x27;, &#x27;Jory-Cassel&#x27;, &#x27;Jon-Arryn&#x27;, &#x27;Brandon-Stark&#x27;, &#x27;Tomard&#x27;, &#x27;Alyn&#x27;, &#x27;Lyanna-Stark&#x27;, &#x27;Vayon-Poole&#x27;, &#x27;Wyl-(guard)&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>260</td>\n",
       "        <td>23</td>\n",
       "        <td>[&#x27;Bran-Stark&#x27;, &#x27;Rodrik-Cassel&#x27;, &#x27;Luwin&#x27;, &#x27;Rickon-Stark&#x27;, &#x27;Hodor&#x27;, &#x27;Jojen-Reed&#x27;, &#x27;Osha&#x27;, &#x27;Walder-Frey-(son-of-Merrett)&#x27;, &#x27;Nan&#x27;, &#x27;Mikken&#x27;]</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[224,\n",
       "  117,\n",
       "  ['Tyrion-Lannister',\n",
       "   'Jaime-Lannister',\n",
       "   'Cersei-Lannister',\n",
       "   'Sansa-Stark',\n",
       "   'Joffrey-Baratheon',\n",
       "   'Tywin-Lannister',\n",
       "   'Petyr-Baelish',\n",
       "   'Varys',\n",
       "   'Tommen-Baratheon',\n",
       "   'Gregor-Clegane']],\n",
       " [279,\n",
       "  91,\n",
       "  ['Jon-Snow',\n",
       "   'Samwell-Tarly',\n",
       "   'Mance-Rayder',\n",
       "   'Jeor-Mormont',\n",
       "   'Aemon-Targaryen-(Maester-Aemon)',\n",
       "   'Janos-Slynt',\n",
       "   'Eddison-Tollett',\n",
       "   'Tormund',\n",
       "   'Bowen-Marsh',\n",
       "   'Craster']],\n",
       " [232,\n",
       "  59,\n",
       "  ['Daenerys-Targaryen',\n",
       "   'Barristan-Selmy',\n",
       "   'Jorah-Mormont',\n",
       "   'Hizdahr-zo-Loraq',\n",
       "   'Quentyn-Martell',\n",
       "   'Drogo',\n",
       "   'Daario-Naharis',\n",
       "   'Rhaegar-Targaryen',\n",
       "   'Irri',\n",
       "   'Viserys-Targaryen']],\n",
       " [333,\n",
       "  52,\n",
       "  ['Theon-Greyjoy',\n",
       "   'Asha-Greyjoy',\n",
       "   'Ramsay-Snow',\n",
       "   'Roose-Bolton',\n",
       "   'Aeron-Greyjoy',\n",
       "   'Balon-Greyjoy',\n",
       "   'Lorren',\n",
       "   'Jeyne-Poole',\n",
       "   'Hagen',\n",
       "   'Aggar']],\n",
       " [222,\n",
       "  48,\n",
       "  ['Catelyn-Stark',\n",
       "   'Robb-Stark',\n",
       "   'Edmure-Tully',\n",
       "   'Lysa-Arryn',\n",
       "   'Robert-Arryn',\n",
       "   'Brynden-Tully',\n",
       "   'Jon-Umber-(Greatjon)',\n",
       "   'Ryman-Frey',\n",
       "   'Rickard-Karstark',\n",
       "   'Lothar-Frey']],\n",
       " [209,\n",
       "  43,\n",
       "  ['Arya-Stark',\n",
       "   'Gendry',\n",
       "   'Yoren',\n",
       "   'Amory-Lorch',\n",
       "   'Beric-Dondarrion',\n",
       "   'Lem',\n",
       "   'Hot-Pie',\n",
       "   'Harwin',\n",
       "   'Anguy',\n",
       "   'Tom-of-Sevenstreams']],\n",
       " [331,\n",
       "  38,\n",
       "  ['Stannis-Baratheon',\n",
       "   'Davos-Seaworth',\n",
       "   'Renly-Baratheon',\n",
       "   'Melisandre',\n",
       "   'Selyse-Florent',\n",
       "   'Randyll-Tarly',\n",
       "   'Axell-Florent',\n",
       "   'Cressen',\n",
       "   'Mathis-Rowan',\n",
       "   'Godry-Farring']],\n",
       " [269,\n",
       "  31,\n",
       "  ['Brienne-of-Tarth',\n",
       "   'Loras-Tyrell',\n",
       "   'Aerys-II-Targaryen',\n",
       "   'Addam-Marbrand',\n",
       "   'Vargo-Hoat',\n",
       "   'Cleos-Frey',\n",
       "   'Dick-Crabb',\n",
       "   'Walton',\n",
       "   'Lyle-Crakehall',\n",
       "   'Pia']],\n",
       " [242,\n",
       "  28,\n",
       "  ['Eddard-Stark',\n",
       "   'Robert-Baratheon',\n",
       "   'Jory-Cassel',\n",
       "   'Jon-Arryn',\n",
       "   'Brandon-Stark',\n",
       "   'Tomard',\n",
       "   'Alyn',\n",
       "   'Lyanna-Stark',\n",
       "   'Vayon-Poole',\n",
       "   'Wyl-(guard)']],\n",
       " [260,\n",
       "  23,\n",
       "  ['Bran-Stark',\n",
       "   'Rodrik-Cassel',\n",
       "   'Luwin',\n",
       "   'Rickon-Stark',\n",
       "   'Hodor',\n",
       "   'Jojen-Reed',\n",
       "   'Osha',\n",
       "   'Walder-Frey-(son-of-Merrett)',\n",
       "   'Nan',\n",
       "   'Mikken']]]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH (c:Character)\n",
    "WHERE exists(c.community)\n",
    "WITH c ORDER BY c.pageRank DESC\n",
    "RETURN c.community as cluster, count(*) AS count, collect(c.name)[..10] as influencers\n",
    "ORDER BY count DESC limit 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Intra community PageRank"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> We can also calculate the **PageRank within communities**.   \n",
    "\n",
    "Run the following query to calculate the page rank for the **2nd largest community**:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>value</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;count(*)&#x27;: 1}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'count(*)': 1}]]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH (c:Character) WHERE EXISTS(c.community)\n",
    "WITH c.community AS communityId, COUNT(*) AS count\n",
    "ORDER BY count DESC\n",
    "SKIP 1 LIMIT 1\n",
    "CALL apoc.cypher.doIt(\n",
    "  \"CALL algo.pageRank(\n",
    "    'MATCH (c:Character) WHERE c.community =\" + communityId + \" RETURN id(c) as id',\n",
    "    'MATCH (c:Character)-[rel]->(c2) WHERE c.community =\" + communityId + \" AND c2.community =\" + communityId + \" RETURN id(c) as source,id(c2) as target, sum(rel.weight) as weight',\n",
    "    {graph:'cypher', writeProperty: 'communityPageRank'}) YIELD nodes RETURN count(*)\", {})\n",
    "YIELD value\n",
    "RETURN value"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>personagem</th>\n",
       "        <th>communityPageRank</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jon-Snow</td>\n",
       "        <td>2.251582142415878</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ygritte</td>\n",
       "        <td>1.6258163579338323</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Samwell-Tarly</td>\n",
       "        <td>1.587915125876718</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Spare-Boot</td>\n",
       "        <td>1.2903841640295468</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tormund</td>\n",
       "        <td>1.0416310369731947</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Small-Paul</td>\n",
       "        <td>0.981316454247987</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Xhondo</td>\n",
       "        <td>0.8886139258854897</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Satin</td>\n",
       "        <td>0.8880798984466348</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Pypar</td>\n",
       "        <td>0.6120499401186054</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Val</td>\n",
       "        <td>0.602313577589014</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Jon-Snow', 2.251582142415878],\n",
       " ['Ygritte', 1.6258163579338323],\n",
       " ['Samwell-Tarly', 1.587915125876718],\n",
       " ['Spare-Boot', 1.2903841640295468],\n",
       " ['Tormund', 1.0416310369731947],\n",
       " ['Small-Paul', 0.981316454247987],\n",
       " ['Xhondo', 0.8886139258854897],\n",
       " ['Satin', 0.8880798984466348],\n",
       " ['Pypar', 0.6120499401186054],\n",
       " ['Val', 0.602313577589014]]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH (c:Character) WHERE exists(c.community)\n",
    "WITH c.community AS communityId, COUNT(*) AS count\n",
    "ORDER BY count DESC\n",
    "SKIP 1 LIMIT 1\n",
    "MATCH (c:Character) WHERE c.community = communityId\n",
    "RETURN c.name as personagem, c.communityPageRank as communityPageRank\n",
    "ORDER BY c.communityPageRank DESC\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Referências"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "[Exploratory Data Analysis](http://guides.neo4j.com/data_science/01_eda.html)  \n",
    "[Graph Algorithms](https://guides.neo4j.com/sandbox/graph-algorithms/)  \n",
    "[A Song of Ice and Fire - Dataset](https://github.com/mathbeveridge/asoiaf/tree/master/data)  \n",
    "[Game of Thrones - HBO dataset](https://github.com/mathbeveridge/gameofthrones)  \n",
    "[The Neo4j Graph Algorithms User Guide v3.5](https://neo4j.com/docs/graph-algorithms/current/)  \n",
    "[Personalized Product Recommendations with Neo4j](http://guides.neo4j.com/sandbox/recommendations)  \n",
    "[cypher-refcard](https://neo4j.com/docs/cypher-refcard/current/?ref=browser-guide)  \n",
    "[Papers With Code](https://paperswithcode.com/area/graphs)  \n",
    "\n",
    "Andrew Beveridge and Michael Chemers, \"The Game of 'The Game of Thrones': Networked Concordances and Fractal Dramaturgy\", in: Paola Brembilla and Ilaria De Pacalis (eds.), Reading Contemporary Serial Television Universes: A Narrative Ecosystem Framework, Routledge, 2018."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "PLAY ON NEO4J :play http://guides.neo4j.com/sandbox/legis-graph"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
